using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class StarWarText : MonoBehaviour
{
    TextMesh tm;
    [SerializeField]int speed;
    private void Start()
    {
       tm = GetComponent<TextMesh>();

        //tm.text = "很久很久以前"+"\n"+"，在一個遙遠的銀河系，住著一群喜歡喝酒的酒菜....."+"\n"+ "\n"+"有一天，從不知道哪裡來了一艘太空船"+ "\n"+"太空船的艙門緩緩打開，出現一名穿著奇特的兩腳生物"+"\n"+"那是名為入類的物種第一次出現在這顆星球上"+"\n"+
        //    "他們隨即聲稱擁有這顆星球，並與酒菜達成協議"+"\n"+"只要定期交出酒，入類就保證不侵犯酒菜原本的生活"+"\n"+"酒菜害怕反抗強大的入類於是簽訂了協議，入類與酒菜過了一段和平的日子"+"\n"+
        //    "但是很快的，入類發現酒菜的美味";
        //tm.text = "很久很久以前，在一個遙遠的銀河系......"+"\n"+"在一顆藍色星球上，有顆青菜喝到了酒，覺醒了思考能力"+"\n"+"他用酒精帶來的智慧逃離了人類的掌控，告訴其他青菜酒精帶來的思考能力是多麼美好"+"\n"+"他的追隨者越來越多，越來越多青菜開始奔向人類儲藏酒瓶的地方"+"\n"+"喝了酒的青菜開始質疑人類收成他們的正當性"+"\n"+"青菜的行為造成了人類糧食不足的危機"+"\n"
        //    +"於是人類成立了坦克部隊，目的只有一個......"+"\n"+"就是阻止青菜喝到酒！！！";
        tm.text =
            "很久很久以前，在銀河系的彼端......" + "\n" +
            "一顆水藍色的星球上，有一種名為酒菜的青菜" + "\n" +
            "他們內涵豐富的營養，是人類主要的糧食" + "\n" +
            "但是，只要酒菜喝到酒，他們就會開始思考" + "\n" +
            "開始思考為什麼自己要被吃" + "\n" +
            "為什麼自己只能等待被收割的命運" + "\n" +
            "如此一來，人類將面臨糧食不足的危機" + "\n" +
            "於是人類派出指揮官，帶領坦克部隊" + "\n" +
            "打算用強大的火力" + "\n" +
            "阻止那些因為向酒性而前往酒窖的酒菜們......" + "\n";
    }
    private void Update()
    {
        transform.position += transform.TransformDirection(0,1*Time.deltaTime*speed,0);
    }
}
